// двойні та самозамиканні

//! textContent
// це память між відкривающимся та закривающимся тегом (не працює з тегами)
//? двойні

//! innerHTML
// це память між відкривающимся та закривающимся тегом (працює з тегами)
//? двойні

//! Atributes
// href src alt type min max value selected  plecholder class id checked title  // * name slot
// read unix   (change data in unix)
// alt -  это атрибут, позволяющий добавить текстовое описание содержимого картинки
// min -  определяет минимально допустимое для ввода значение для числа или дати
// max - определяет максимальное допустимое для ввода значение для числа или дати
// name - використовується для посилання на елемент в JavaScript чи при зверненні на дані форми після того, як форма була відправлена.
// slot -  является частью набора технологии Web Components, является заполнителем внутри веб компонента, который можно заполнить собственной разметкой, которая позволяет создавать отдельные деревья DOM и представлять их вместе.

//! href
// шлях на файл
//? a href

//! src
// шлях на файл (img, mp4,audio)   (file js)
//? img audio video script
